test/php-src/ext-soap-tests-bug48557.test.js

// eslint-disable prettier/prettier
const parser = require("../main");

describe("php-src tests", function () {
  // ext/soap/tests/bug48557.phpt
  it("Bug #48557 (Numeric string keys in Apache Hashmaps are not cast to integers)", function () {
    expect(parser.parseCode("<?php\nerror_reporting(E_ALL);\nini_set('display_errors', 1);\nini_set(\"soap.wsdl_cache_enabled\", 0);\nfunction test($map) {\n    var_dump($map, $map[1], $map[2]);die;\n}\n$y = new SoapServer(__DIR__ . '/bug48557.wsdl');\n$y->addfunction(\"test\");\n$request = <<<XML\n<?xml version=\"1.0\"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns1=\"http://test-uri/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:ns2=\"http://xml.apache.org/xml-soap\" xmlns:SOAP-ENC=\"http://schemas.xmlsoap.org/soap/encoding/\" SOAP-ENV:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\n    <SOAP-ENV:Body>\n        <ns1:test>\n            <testParam xsi:type=\"ns2:Map\">\n                <item>\n                    <key xsi:type=\"xsd:int\">1</key>\n                    <value xsi:type=\"xsd:int\">123</value>\n                </item>\n                <item>\n                    <key xsi:type=\"xsd:int\">-1000</key>\n                    <value xsi:type=\"xsd:string\">123</value>\n                </item>\n                <item>\n                    <key xsi:type=\"xsd:string\">2</key>\n                    <value xsi:type=\"xsd:float\">123.5</value>\n                </item>\n                <item>\n                    <key xsi:type=\"xsd:string\">-2000</key>\n                    <value xsi:type=\"xsd:float\">123.5</value>\n                </item>\n                <item>\n                    <key xsi:type=\"xsd:string\">011</key>\n                    <value xsi:type=\"xsd:float\">123.5</value>\n                </item>\n                <item>\n                    <key xsi:type=\"xsd:int\">012</key>\n                    <value xsi:type=\"xsd:float\">123.5</value>\n                </item>\n            </testParam>\n        </ns1:test>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\nXML;\n$y->handle($request);\n?>\n===DONE===")).toMatchSnapshot();
  });
});
